## [ DataFrame 행/열 추가 ]

(1) 모듈 로딩

In [1]:
import pandas as pd

(2) 데이터 준비

In [2]:
# dict 타입의 데이터 생성
exam = {'이름':['마징가', '배트맨', '홍길동', '임꺽정'],
       '국어':[98, 79, 99, 100],
       '수학':[90, 100, 70, 30],
       '미술':[50, 75, 92, 40],
       '체육':[100, 100, 100, 80]}

(3) DataFrame에 데이터 저장

In [3]:
examDF = pd.DataFrame(exam)

In [4]:
examDF

    이름   국어   수학  미술   체육
0  마징가   98   90  50  100
1  배트맨   79  100  75  100
2  홍길동   99   70  92  100
3  임꺽정  100   30  40   80

<hr> (4) 저장된 데이터 속성 확인 <hr>

In [5]:
def printAttribute(df, dname):
    print(f'[{dname}]')
    print(f'index\n===> {df.index}\n')
    print(f'columns\n===> {df.columns}\n')
    print(f'shape\n===> {df.shape}\n')
    print(f'ndim\n===> {df.ndim}\n')
    print(f'size\n===> {df.size}\n')
    print(f'dtypes\n===> {df.dtypes}\n')

In [6]:
printAttribute(examDF, 'examDF')

[examDF]
index
===> RangeIndex(start=0, stop=4, step=1)

columns
===> Index(['이름', '국어', '수학', '미술', '체육'], dtype='object')

shape
===> (4, 5)

ndim
===> 2

size
===> 20

dtypes
===> 이름    object
국어     int64
수학     int64
미술     int64
체육     int64
dtype: object

In [7]:
print(type(examDF.dtypes))

<class 'pandas.core.series.Series'>

<hr> (5) DataFrame에 컬럼(column) 추가 <hr>  

* DF객체변수명[새로운컬러명] = 값

In [8]:
examDF.columns

Index(['이름', '국어', '수학', '미술', '체육'], dtype='object')

In [9]:
# 행의 개수만큼 값 추가
examDF['영어'] = [90, 89, 100, 91]

In [10]:
examDF

    이름   국어   수학  미술   체육   영어
0  마징가   98   90  50  100   90
1  배트맨   79  100  75  100   89
2  홍길동   99   70  92  100  100
3  임꺽정  100   30  40   80   91

In [11]:
# 1개의 데이터(값) 추가 시 모든 행에 동일 값으로 저장
examDF['과학'] = 80

In [12]:
examDF

    이름   국어   수학  미술   체육   영어  과학
0  마징가   98   90  50  100   90  80
1  배트맨   79  100  75  100   89  80
2  홍길동   99   70  92  100  100  80
3  임꺽정  100   30  40   80   91  80

In [13]:
# 길이도 안 똑같고, 그렇다고 1개도 아닌 어중간한 숫자의 값을 넘기면 오류발생
# examDF['컴퓨터'] = [90, 87]

In [14]:
examDF.columns

Index(['이름', '국어', '수학', '미술', '체육', '영어', '과학'], dtype='object')

<hr> (6) DataFrame에 행(row) 추가 <hr>

* 방법 : DF객체변수명.loc[새로운 행인덱스] = [컬럼 수만큼의 데이터]
* 방법 : DF객체변수명.loc[새로운 행인덱스] = 데이터
* 불가 방법 : DF객체변수명.iloc[새로운 행인덱스] = 데이터 (왜? 데이터 존재해야지 인덱스 할당됨)

In [15]:
examDF

    이름   국어   수학  미술   체육   영어  과학
0  마징가   98   90  50  100   90  80
1  배트맨   79  100  75  100   89  80
2  홍길동   99   70  92  100  100  80
3  임꺽정  100   30  40   80   91  80

In [16]:
examDF.index

RangeIndex(start=0, stop=4, step=1)

In [17]:
# 컬럼 수 만큼의 데이터를 가진 행 추가
examDF.loc[4] = ['원더우먼', 88, 89, 90, 91, 92, 95]

In [18]:
examDF

     이름   국어   수학  미술   체육   영어  과학
0   마징가   98   90  50  100   90  80
1   배트맨   79  100  75  100   89  80
2   홍길동   99   70  92  100  100  80
3   임꺽정  100   30  40   80   91  80
4  원더우먼   88   89  90   91   92  95

In [19]:
# 행 추가시 iloc는 사용불가 => 왜? 데이터 수에 맞게 인덱스 범위 지정이 되기 때문에
# 리스트는 새로운 인덱스 할당 x (인덱스 방식)
# 딕셔너리는 새로운 키 할당 o (키 방식 ~ 라벨)
# 이걸 떠올리자!
# examDF.iloc[5] = ['슈퍼맨', 88, 89, 90, 91, 92, 100]

In [20]:
# 1개 데이터 가진 행 추가
examDF.loc[5] = '슈퍼맨'

In [21]:
examDF

     이름   국어   수학   미술   체육   영어   과학
0   마징가   98   90   50  100   90   80
1   배트맨   79  100   75  100   89   80
2   홍길동   99   70   92  100  100   80
3   임꺽정  100   30   40   80   91   80
4  원더우먼   88   89   90   91   92   95
5   슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨